# Ch3.4 Aggregation and Grouping

## Simple Aggregation in Pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
np.__version__,pd.__version__

('1.17.4', '0.25.3')

For Pandas ``Series``

In [3]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.rand(5))
ser

0    0.374540
1    0.950714
2    0.731994
3    0.598658
4    0.156019
dtype: float64

In [4]:
ser.sum()

2.811925491708157

In [5]:
ser.mean()

0.5623850983416314

In [6]:
# NaN 處理
data = pd.Series([1, np.nan, 3, None])
data

0    1.0
1    NaN
2    3.0
3    NaN
dtype: float64

In [7]:
data.sum()

4.0

In [8]:
# NaN 不算個數
data.mean()

2.0

For a ``DataFrame``, by default the aggregates return results within each column:

In [9]:
df = pd.DataFrame({'A': rng.rand(5),
                   'B': rng.rand(5)})
df

          A         B
0  0.155995  0.020584
1  0.058084  0.969910
2  0.866176  0.832443
3  0.601115  0.212339
4  0.708073  0.181825

In [11]:
# 預設 axis='index'
df.mean()

A    0.477888
B    0.443420
dtype: float64

In [12]:
df.mean(axis='columns')

0    0.088290
1    0.513997
2    0.849309
3    0.406727
4    0.444949
dtype: float64

## Planets Data

In [14]:
import seaborn as sns

In [15]:
# load dataset(internet import)
planets = sns.load_dataset('planets')
planets.shape

(1035, 6)

In [16]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [17]:
planets.tail()

       method  number  orbital_period  mass  distance  year
1030  Transit       1        3.941507   NaN     172.0  2006
1031  Transit       1        2.615864   NaN     148.0  2007
1032  Transit       1        3.191524   NaN     174.0  2007
1033  Transit       1        4.125083   NaN     293.0  2008
1034  Transit       1        4.187757   NaN     260.0  2008

In [18]:
planets.isnull().values.any()

True

In [19]:
planets.isnull().any()

method            False
number            False
orbital_period     True
mass               True
distance           True
year              False
dtype: bool

In [20]:
# drop NA 的 index，做資料分析
planets.dropna().describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

## GroupBy

In [21]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data': range(6)}, columns=['key', 'data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [22]:
# DataFrameGroupBy -> lazy evalution (呼叫 funtion，才去做運算)
df.groupby('key')

In [23]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

#### Column indexing

In [27]:
# 查詢 method 有幾種 
planets.drop_duplicates(['method']).shape

(10, 6)

In [31]:
planets.drop_duplicates(['method'])

,method,number,orbital_period,mass,distance,year
0,Radial Velocity,1,269.300000,7.10,77.40,2006
29,Imaging,1,NaN,NaN,45.52,2005
32,Eclipse Timing Variations,1,10220.000000,6.05,NaN,2009
91,Transit,1,1.508956,NaN,NaN,2008
113,Astrometry,1,246.360000,NaN,20.77,2013
680,Transit Timing Variations,2,160.000000,NaN,2119.00,2011
787,Orbital Brightness Modulation,2,0.240104,NaN,1180.00,2011
902,Microlensing,1,NaN,NaN,NaN,2008
941,Pulsar Timing,3,25.262000,NaN,NaN,1992
958,Pulsation Timing Variations,1,1170.000000,NaN,NaN,2007

In [24]:
planets.groupby('method')

In [28]:
planets.groupby('method')['orbital_period']

no computation is done until we call some aggregate on the object:

In [30]:
planets.groupby('method')['orbital_period'].median().size

10

In [29]:
planets.groupby('method')['orbital_period'].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

In [32]:
planets.groupby('method')['year'].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,2011.500000,2.121320,2010.0,2010.75,2011.5,2012.25,2013.0
Eclipse Timing Variations,9.0,2010.000000,1.414214,2008.0,2009.00,2010.0,2011.00,2012.0
Imaging,38.0,2009.131579,2.781901,2004.0,2008.00,2009.0,2011.00,2013.0
Microlensing,23.0,2009.782609,2.859697,2004.0,2008.00,2010.0,2012.00,2013.0
Orbital Brightness Modulation,3.0,2011.666667,1.154701,2011.0,2011.00,2011.0,2012.00,2013.0
Pulsar Timing,5.0,1998.400000,8.384510,1992.0,1992.00,1994.0,2003.00,2011.0
Pulsation Timing Variations,1.0,2007.000000,NaN,2007.0,2007.00,2007.0,2007.00,2007.0
Radial Velocity,553.0,2007.518987,4.249052,1989.0,2005.00,2009.0,2011.00,2014.0
Transit,397.0,2011.236776,2.077867,2002.0,2010.00,2012.0,2013.00,2014.0
Transit Timing Variations,4.0,2012.500000,1.290994,2011.0,2011.75,2012.5,2013.25,2014.0

### Simple Concatenation with pd.concat

In [34]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])

In [35]:
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])

In [36]:
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

By default, the concatenation takes place row-wise within the ``DataFrame`` (i.e., axis=0)

In [37]:
df1 = pd.DataFrame([['A1','B1'], ['A2','B2']],
             columns=['A', 'B'],
             index=[1,2])
df1

    A   B
1  A1  B1
2  A2  B2

In [38]:
df2 = pd.DataFrame([['A3','B3'], ['A4','B4']],
             columns=['A', 'B'],
             index=[3,4])
df2

    A   B
3  A3  B3
4  A4  B4

In [40]:
# same columns 
pd.concat([df1, df2])

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [47]:
df1 = pd.DataFrame([['A1','B1'], ['A2','B2']],
             columns=['A', 'B'])
df1

    A   B
0  A1  B1
1  A2  B2

In [48]:
df2 = pd.DataFrame([['A3','B3'], ['A4','B4']],
             columns=['A', 'B'])
df2

    A   B
0  A3  B3
1  A4  B4

In [49]:
pd.concat([df1, df2])

    A   B
0  A1  B1
1  A2  B2
0  A3  B3
1  A4  B4

In [50]:
# ignore_index (自動編 index)
pd.concat([df1, df2], ignore_index=True)

    A   B
0  A1  B1
1  A2  B2
2  A3  B3
3  A4  B4

pd.concat allows specification of an axis along which concatenation will take place

In [41]:
df3 = pd.DataFrame([['A0','B0'], ['A1','B1']],
             columns=['A', 'B'],
             index=[0,1])
df3

    A   B
0  A0  B0
1  A1  B1

In [42]:
df4 = pd.DataFrame([['C0','D0'], ['C1','D1']],
             columns=['C', 'D'],
             index=[0,1])
df4

    C   D
0  C0  D0
1  C1  D1

In [44]:
# 擴增欄位：建議用 merge() 
pd.concat([df3, df4], axis='columns')

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1

The append() method

In [45]:
# 相當於 pd.concat([df1,df2])
df1.append(df2)

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4